

let menu=document.querySelector('#menu-icon');
let navbar=document.querySelector('.navbar');


menu.onclick= () => {
    menu.classList.toggle('bx-x')
    navbar.classList.toggle('open')
};



for( var m = 1 ; m <= 624 ; m++ ) {
    if( m < 10 ) {
        document.write('<img id="imgmor' +m+'"  src="./image/quran-00'+m+'.jpg"  class="quranread"  />')
    } else if( m < 100 ) {
        document.write('<img id="imgmor' +m+'"  src="./image/quran-0'+ m+'.jpg"  class="quranread"  />')
    } else {
        document.write('<img id="imgmor' +m+'"  src="./image/quran-'+m+'.jpg" class="quranread"  />')
    }
};



let inp= document.getElementById("in");

let bah=document.getElementById("bah");


bah.onclick=() => {
    var y= parseInt(inp.value )+3;
    // mot(y)
     document.location='#imgmor' + y;
}

// function mot(dob){
//     for( var m = 1 ; m <= 624 ; m++ ) { 
//         document.getElementById("imgmor" + m ).style.display="none";
//     }
//    document.getElementById( "imgmor" + dob) .style.display="block"
// }





let sura=[
    [ 
        1," الفاتحة" ,
    ],
    [ 
        2," البقرة" ,
    ],
    [ 
        50 ," آل عمران" ,
    ],
    [ 
        77," النساء" ,
    ],
    [ 
        106 ," المائدة" ,
    ],
    [ 
        128 ,"  الانعام " ,
    ],
    [ 
        151 ,"  الأعراف " ,
    ],
    [ 
       177 ," الأنفال  " ,
   ],
   [ 
    187 ,"  التوبة " ,
  ],
  [ 
   208 ," يونس  " ,
  ],
  [ 
   221 ,"  هود " ,
],
[ 
   235 ," يوسف  " ,
],
[ 
   249 ,"  الرعد " ,
],
[ 
    255,"  إبراهيم " ,
],
[ 
  262  ,"  الحجر " ,
],
[ 
   267 ," النحل  " ,
],
[ 
   282 ,"  الإسراء " ,
],
[ 
   293 ,"  الكهف " ,
],
[ 
   305 ," مريم  " ,
],
[ 
   312 ," طه  " ,
],
[ 
  322  ," الأنبياء " ,
],
[ 
   332 ,"  الحج " ,
],
[ 
  342  ,"  المؤمنون " ,
],
[ 
  350  ," النور  " ,
],
[ 
  359  ,"  الفرقان " ,
],
[ 
   367 ,"  الشعراء " ,
],
[ 
    377," النمل  " ,
],
[ 
   385 ,"  القصص " ,
],
[ 
   396 ," العنكبوت  " ,
],
[ 
   404 ," الروم  " ,
],
[ 
    411," لقمان  " ,
],
[ 
   415 ," السجدة  " ,
],
[ 
    418,"  الأحزاب " ,
],
[ 
   428 ,"  سبأ " ,
],
[ 
   434," فاطر   " ,
],
[ 
    440,"  يس " ,
],
[ 
   446 ,"  الصافات " ,
],
[ 
    453,"  ص " ,
],
[ 
    458," الزمر  " ,
],
[ 
   467 ,"  غافر " ,
],
[ 
   477 ," فصلت  " ,
],
[ 
   483 ," الشورى  " ,
],
[ 
    489," الزخرف  " ,
],
[ 
   496 ," الدخان  " ,
],
[ 
    499," الجاثية  " ,
],
[ 
   502 ,"  الاحقاف " ,
],
[ 
   507 ,"  محمد " ,
],
[ 
   511 ,"  الفتح " ,
],
[ 
   515 ,"  الحجرات " ,
],
[ 
   518 ,"  ق " ,
],
[ 
   520 ," الذاريات  " ,
],
[ 
   523 ," الطور  " ,
],
[ 
   526 ,"  النجم " ,
],
[ 
   528 ," القمر  " ,
],
[ 
   531 ,"  الرحمن " ,
],
[ 
   534 ,"  الواقعة " ,
],
[ 
   537 ,"  الحديد " ,
],
[ 
   542 ,"  المجادلة " ,
],
[ 
  545  ," الحشر  " ,
],
[ 
   549 ,"  الممتحنة " ,
],
[ 
  551  ,"  الصف " ,
],
[ 
   553 ," الجمعة  " ,
],
[ 
   554 ,"  المنافقون " ,
],
[ 
    556," التغابن  " ,
],
[ 
   558 ," الطلاق  " ,
],
[ 
   560 ,"  التحريم " ,
],
[ 
   562 ," الملك  " ,
],
[ 
   564 ,"  القلم " ,
],
[ 
    566," الحاقة  " ,
],
[ 
   568 ,"  المعارج " ,
],
[ 
   570 ," نوح  " ,
],
[ 
   572 ,"  الجن " ,
],
[ 
   574 ," المزمل  " ,
],
[ 
   575 ,"  المدثر " ,
],
[ 
   577 ,"  القيامة " ,
],
[ 
    578,"  الإنسان " ,
],
[ 
   580 ,"  المرسلات " ,
],
[ 
   582 ," النبأ  " ,
],
[ 
   583 ," النازعات  " ,
],
[ 
    585 ," عبس  " ,
],
[ 
   586 ," التكوير  " ,
],
[ 
  587  ,"  الانفطار " ,
],
[ 
   587 ,"  المطففين " ,
],
[ 
   589 ,"  الانشقاق " ,
],
[ 
   590 ," البروج  " ,
],
[ 
   591 ,"  الطارق " ,
],
[ 
   591 ,"  الأعلى " ,
],
[ 
   592 ,"  الغاشية " ,
],
[ 
   593 ,"  الفجر " ,
],
[ 
   594 ,"  البلد " ,
],
[ 
  595  ,"  الشمس " ,
],
[ 
   595 ," الليل  " ,
],
[ 
   596 ,"   الضحى" ,
],
[ 
   596 ," الشرح  " ,
],
[ 
   597 ,"  التين " ,
],
[ 
   597 ,"  العلق " ,
],
[ 
   598 ,"  القدر " ,
],
[ 
   598 ,"  البينة " ,
],
[ 
   599 ,"  الزلزلة " ,
],
[ 
   599 ," العاديات  " ,
],
[ 
   600 ,"  القارعة " ,
],
[ 
   600 ," التكاثر  " ,
],
[ 
   601 ,"  العصر " ,
],
[ 
   601 ,"  الهمزة " ,
],
[ 
  601  ,"  الفيل " ,
],
[ 
   602 ,"  قريش " ,
],
[ 
   602 ,"  الماعون " ,
],
[ 
    602,"  الكوثر " ,
],
[ 
  603  ,"  الكافرون " ,
],
[ 
   603 ," النصر  " ,
],
[ 
   603 ," المسد  " ,
],
[ 
   604 ,"  الإخلاص " ,
],
[ 
  604  ,"  الفلق " ,
],
[ 
   604 ," الناس  " ,
],



]


for( var m = 0 ; m < sura.length ; m++ ) {
   btns.innerHTML += '<button onclick="ashmnkan('+sura[m][0]+')">'+sura[m][1]+'</button>'
}

function ashmnkan(value) {
   var y= parseInt(value )+3;
   document.location='#imgmor' + y;
   btns.style.display = 'none'
}


btn_top.onclick =  () => document.location = '#'